EgorNezox/Lol/system/qm-platform/stm32f2xx/HAL/src/i2c.c
/**
  ******************************************************************************
  * @file    i2c.c
  * @author  Artem Pisarenko, PMR dept. software team, ONIIP, PJSC
  * @date    24.11.2015
  * @brief   Реализация аппаратной абстракции доступа к I2C на STM32F2xx
  *
  * Notes:
  * - Don't set NOSTRETCH bit in slave transmit mode (workaround p2.3.4 of Errata sheet Rev 5).
  * - Don't set NOSTRETCH bit because otherwise we cannot handle slave mode transfer properly
  *   (not only because of data can't be ready in time, but also because of avoiding of possible races
  *   between writing CR1 register and losing STOPF flag).
  * - Even with disabled smbus host (no slave role) I2C bus must still be enabled on persistent basis (rather than for master transfer duration only),
  *   because there are no way to get "STOP finished"/"bus not busy" event required to disable bus properly.
  * - After stopping master transfer, a dummy START-STOP transaction executed.
  *   It's a workaround for "shitty" STM32F2 I2C peripheral limitation (there are no "STOP finished"/"bus not busy" event).
  * - Enabling/disabling smbus host may execute dummy START-STOP transaction, because it's the only way
  *   to set/clear ACK bit while peripheral enabled avoiding racing with possible addressing in multimaster bus
  *   (when ADDR is set but we don't know whether peripheral acknowledged it).
  *   You might suppose that we would temporarily disable bus, but we cannot check or wait a state,
  *   when interface will be slave mode, because it requires SR2 polling (unacceptable),
  *   and also reading SR2 may cause side effects we cannot handle.
  * - SMBus mode violates specification by not supporting timeout mechanism.
  *   It's because we cannot use controller in SMBUS=1 hardware mode due to defective TIMEOUT error implementation.
  *   TIMEOUT error in master transfer may cause exit master mode in uncontrolled and "software-asynchronous" way.
  *   Firstly, it doesn't allow to safely set/clear ACK bit due to racing condition (see previous notes).
  *   Secondly, if ACK bit left set while smbus host disabled, controller will acknowledge any arbitrary address (from OAR1)
  *   issued by other master on bus between returning to slave mode and restoring ACK=0 by software.
  *   As a consequence, SMBus host notify feature uses OAR1 with SMBus Host address rather than using ENARP=1 and SMBTYPE=1.
  *   (But even if we would use SMBUS=1, we still must use this method, because we want to acknowledge only this one address,
  *    but we cannot disable acknowledging of address contained in OAR1.)
  * - In SMBus mode host may miss host notification if it happens at the same time (or shortly after)
  *   it accesses bus to perform master transaction and loses arbitration.
  *   It's a hardware limitations we are not able to workaround.
  * - During testing a new hardware bug has been discovered (not present in errata sheet and isn't confirmed by ST team at this time).
  *   Conditions: controller configured in slave mode (Standard Mode I2C, NOSTRETCH=0), and two consecutive transfers (START-address-data-...-STOP)
  *   being executed: slave transmitter mode, immediately(!) followed by slave receiver mode without enough clock stretching.
  *   After that, controller cannot generate START condition until software issues SWRST.
  *   Workaround is to insert 1ms delay in slave transfer between getting ADDR=1 and clearing ADDR, forcing controller to stretch SCL low.
  * - Tricky scenarios were discovered during testing. Bus error may happen even in START/STOP generation phases due to
  *   spikes, incorrect timings due to bad capacities on bus, misbehavior of other masters, or whatever.
  *   For transfer finishing scenario I'm not even sure that bus error doesn't happen in last byte transfer phase and RXNE bit being set just before BERR.
  * Features, limitations and strange behavior in this implementation are result of many compromises and hard work.
  * (Say thanks to STMicroelectronics for their wonderful controller!)
  *
  ******************************************************************************
  */

#include "stm32f2xx.h"
#include "FreeRTOS.h"

#include "sys_internal.h"
#include "hal_timer.h"
#include "hal_i2c.h"

#define I2C_MASTER_SPEED_CLOCK	88000 // using 88kHz clock to workaround p2.3.3 of Errata sheet Rev 5
#define I2C_INSTANCES_COUNT 3
#define I2C_SMBUS_HOST_ADDRESS	0x08
#define I2C_SR1_BUS_ERROR_FLAGS	(I2C_SR1_BERR | I2C_SR1_ARLO)

#define DEFINE_PCB_FROM_HANDLE(var_pcb, handle) \
	struct s_i2cbus_pcb *var_pcb = (struct s_i2cbus_pcb *)handle; \
	SYS_ASSERT(var_pcb != 0);

typedef enum {
	stateIdle,
	stateStartingMaster,
	stateMasterAddressing,
	stateMasterRxSingleByte,
	stateMasterRxFirstN2Bytes,
	stateMasterRxLast2Bytes,
	stateMasterTxStarting,
	stateMasterTxData,
	stateMasterTxPEC,
	stateMasterTxStopping,
	stateMasterFinishing,
	stateSlaveAddressed,
	stateSlaveReadyToTransfer,
	stateSlaveTx,
	stateSlaveRxSMBusHostAddress,
	stateSlaveRxSMBusHostDataLow,
	stateSlaveRxSMBusHostDataHigh,
	stateSlaveStopping
} i2c_state_t;

static struct s_i2cbus_pcb {
	I2C_TypeDef* i2c;
	IRQn_Type ev_irq_n;
	IRQn_Type er_irq_n;
	uint32_t rcc_apb_mask;
	hal_timer_handle_t slave_addr_delay_timer;
	hal_i2c_mode_t mode;
	i2c_state_t state;
	bool smbus_host_enabled;
	bool smbus_host_change_request;
	hal_i2c_smbus_host_params_t smbus_host_params;
	DLLIST_LIST_TYPE(hal_i2c_mt_queue) mt_queue;
	struct hal_i2c_master_transfer_t *active_mt;
	hal_i2c_transfer_result_t active_mt_result;
	int active_mt_pos;
	uint8_t active_mt_pec;
	struct hal_i2c_master_transfer_t *aborted_mt;
	i2c_state_t last_state; // used in slave mode communications
	bool smbushost_transfer_ready;
	uint8_t smbushost_address;
	uint16_t smbushost_status;
} i2cbus_pcbs[I2C_INSTANCES_COUNT] = {
	{I2C1, I2C1_EV_IRQn, I2C1_ER_IRQn, RCC_APB1ENR_I2C1EN, 0, hi2cModeOff, stateIdle, false, false, {0, 0}, DLLIST_LIST_POD_INITIALIZER, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0},
	{I2C2, I2C2_EV_IRQn, I2C2_ER_IRQn, RCC_APB1ENR_I2C2EN, 0, hi2cModeOff, stateIdle, false, false, {0, 0}, DLLIST_LIST_POD_INITIALIZER, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0},
	{I2C3, I2C3_EV_IRQn, I2C3_ER_IRQn, RCC_APB1ENR_I2C3EN, 0, hi2cModeOff, stateIdle, false, false, {0, 0}, DLLIST_LIST_POD_INITIALIZER, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0}
};

static uint8_t i2c_pec_precalc_table[256];

static void i2c_push_to_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t);
static struct hal_i2c_master_transfer_t* i2c_pop_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus);
static bool i2c_master_transfer_queue_is_empty(struct s_i2cbus_pcb *i2cbus);
static void i2c_remove_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t);
static inline void i2c_set_irq_pending(struct s_i2cbus_pcb *i2cbus);
static uint32_t i2c_get_slave_mode_ack(struct s_i2cbus_pcb *i2cbus);
static inline void i2c_request_start_condition(struct s_i2cbus_pcb *i2cbus);
static inline void i2c_request_stop_condition(struct s_i2cbus_pcb *i2cbus);
static void i2c_stop_master_transfer(struct s_i2cbus_pcb *i2cbus);
static void i2c_reset_master_mode(struct s_i2cbus_pcb *i2cbus);
static void i2c_reset_master_mode_to_idle(struct s_i2cbus_pcb *i2cbus);
static void i2c_restore_bus_after_error(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint32_t i2c_SR1_stop_flags);
static void i2c_abort_master_transfer(struct s_i2cbus_pcb *i2cbus);
static void i2c_close_active_master_transfer(struct s_i2cbus_pcb *i2cbus, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static bool i2c_process_master_rx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static bool i2c_process_master_tx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void i2c_receive_master_data_byte(struct s_i2cbus_pcb *i2cbus);
static void i2c_transmit_master_data_byte(struct s_i2cbus_pcb *i2cbus);
static void i2c_request_change_slave_mode(struct s_i2cbus_pcb *i2cbus);
static bool i2c_process_slave_rx_conditions(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1);
static int i2c_get_master_max_bytes_to_receive(struct s_i2cbus_pcb *i2cbus);
static inline uint8_t i2c_calc_pec(uint8_t pec, uint8_t data);
static void i2c_timer_slave_addr_delay_callback(hal_timer_handle_t handle);
static void i2c_irq_handler(struct s_i2cbus_pcb *i2cbus);
static void i2c_irq_handler_smbus_host(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void i2c_irq_handler_master(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);

void halinternal_i2c_init(void) {
	for (int i = 0; i < sizeof(i2cbus_pcbs)/sizeof(i2cbus_pcbs[0]); i++) {
		struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[i]);
		hal_timer_params_t slave_addr_delay_timer_params;
		slave_addr_delay_timer_params.userid = (void *)i2cbus;
		slave_addr_delay_timer_params.callbackTimeout = i2c_timer_slave_addr_delay_callback;
		i2cbus->slave_addr_delay_timer = hal_timer_create(&slave_addr_delay_timer_params);
		halinternal_set_nvic_priority(i2cbus->ev_irq_n);
		NVIC_EnableIRQ(i2cbus->ev_irq_n);
		halinternal_set_nvic_priority(i2cbus->er_irq_n);
		NVIC_EnableIRQ(i2cbus->er_irq_n);
	}
	for (uint32_t i = 0; i < sizeof(i2c_pec_precalc_table)/sizeof(i2c_pec_precalc_table[0]); i++) {
		uint32_t value = i;
		for (int j = 0; j < 8; j++)
			if (value & 0x80)
				value = (value << 1) ^ 0x07;
			else
				value <<= 1;
		i2c_pec_precalc_table[i] = value & 0xFF;
	}
}

