EgorNezox/Lol/system/qm-platform/stm32f2xx/HAL/src/i2c.c
void hal_i2c_set_bus_mode(int instance, hal_i2c_mode_t mode) {
	SYS_ASSERT((1 <= instance) && (instance <= I2C_INSTANCES_COUNT));
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[instance-1]);
	switch (mode) {
	case hi2cModeStandard:
	case hi2cModeSMBus: {
		uint32_t freqrange;
		halinternal_rcc_clocks_t rcc_clocks;
		uint32_t ccr_value;
		portDISABLE_INTERRUPTS();
		SYS_ASSERT(i2cbus->mode == hi2cModeOff);
		i2cbus->mode = mode;
		RCC->APB1ENR |= (i2cbus->rcc_apb_mask);
		__DSB();
		i2cbus->i2c->CR1 |= I2C_CR1_SWRST;
		i2cbus->i2c->CR1 &= ~I2C_CR1_SWRST;
		halinternal_get_rcc_clocks(&rcc_clocks);
		freqrange = rcc_clocks.pclk1_frequency/1000000;
		i2cbus->i2c->CR2 |= freqrange & I2C_CR2_FREQ;
		i2cbus->i2c->CR2 |= I2C_CR2_ITEVTEN;
		i2cbus->i2c->TRISE = (freqrange + 1) & I2C_TRISE_TRISE; // using standard speed mode
		ccr_value = rcc_clocks.pclk1_frequency/(I2C_MASTER_SPEED_CLOCK << 1);
		i2cbus->i2c->CCR = (((ccr_value & I2C_CCR_CCR) < 4)? 4 : (ccr_value)) & I2C_CCR_CCR; // using standard speed mode (also for SMBus mode)
		if (mode == hi2cModeSMBus) {
			/* don't use SMBUS=1 mode (see design notes in source header) */
			i2cbus->i2c->OAR1 = (I2C_SMBUS_HOST_ADDRESS << POSITION_VAL(I2C_OAR1_ADD1_7)); // slave mode: 7-bit addressing, SMBus Host address
		}
		i2cbus->i2c->CR1 |= I2C_CR1_PE;
		i2cbus->smbus_host_change_request = false;
		portENABLE_INTERRUPTS();
		break;
	}
	case hi2cModeOff: {
		bool interface_is_busy;
		portDISABLE_INTERRUPTS();
		SYS_ASSERT(i2cbus->mode != hi2cModeOff);
		i2cbus->mode = mode;
		i2cbus->smbus_host_enabled = false;
		if (i2cbus->active_mt == 0) { // no master transfer in progress ?
			if (i2cbus->state != stateStartingMaster) { // special case (no worries, it has proper handling for updated mode)
				/* Slave transfer may be in progress and will be dropped. */
				i2cbus->state = stateIdle;
				i2c_set_irq_pending(i2cbus);
			}
		} else {
			i2c_abort_master_transfer(i2cbus); // it will return to idle state
		}
		/* Since now we are in idle state (or on way to it). Idle state has appropriate cleanup for switching off. */
		portENABLE_INTERRUPTS();
		hal_timer_stop(i2cbus->slave_addr_delay_timer);
		do {
			portDISABLE_INTERRUPTS();
			// short-circuit evaluation is important here: don't read SR2 until we reach idle state (to prevent loss of flags)
			interface_is_busy = !((i2cbus->state == stateIdle) && ((i2cbus->i2c->SR2 & I2C_SR2_MSL) == 0));
			if (!interface_is_busy) {
				i2cbus->i2c->CR1 = 0;
				__DSB();
				RCC->APB1ENR &= ~(i2cbus->rcc_apb_mask);
			}
			portENABLE_INTERRUPTS();
		} while (interface_is_busy);
		break;
	}
	default: SYS_ASSERT(0);
	}
}

void hal_i2c_init_master_transfer_struct(struct hal_i2c_master_transfer_t *t) {
	DLLIST_INIT_ELEMENT(hal_i2c_mt_queue, t);
	t->device.bus_instance = 0;
	t->device.address = 0;
	t->use_pec = false;
	t->dirs = 0;
	t->data = 0;
	t->size = 0;
	t->userid = 0;
	t->isrcallbackTransferCompleted = 0;
}

bool hal_i2c_start_master_transfer(struct hal_i2c_master_transfer_t *t) {
	SYS_ASSERT(t);
	SYS_ASSERT((1 <= t->device.bus_instance) && (t->device.bus_instance <= I2C_INSTANCES_COUNT));
	SYS_ASSERT((t->device.address & ~0x7F) == 0);
	SYS_ASSERT(t->size >= 0);
	if (t->size > 0) {
		SYS_ASSERT(t->dirs);
		SYS_ASSERT(t->data);
	} else {
		SYS_ASSERT(t->use_pec == false);
	}
	SYS_ASSERT(t->isrcallbackTransferCompleted);
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[t->device.bus_instance-1]);
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (i2cbus->mode != hi2cModeOff) {
		i2c_push_to_master_transfer_queue(i2cbus, t);
		if (i2cbus->state == stateIdle)
			i2c_set_irq_pending(i2cbus);
		success = true;
	}
	portENABLE_INTERRUPTS();
	return success;
}

bool hal_i2c_abort_master_transfer(struct hal_i2c_master_transfer_t *t) {
	SYS_ASSERT(t);
	SYS_ASSERT((1 <= t->device.bus_instance) && (t->device.bus_instance <= I2C_INSTANCES_COUNT));
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[t->device.bus_instance-1]);
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (i2cbus->mode != hi2cModeOff) {
		if (t == i2cbus->active_mt) { // is it in progress ?
			i2c_abort_master_transfer(i2cbus);
			success = true;
		} else { // it's expected to be still queued
			if (!i2c_master_transfer_queue_is_empty(i2cbus)) { // checks case when it removed from top of queue just few moments ago
				i2c_remove_from_master_transfer_queue(i2cbus, t);
				SYS_ASSERT(i2cbus->aborted_mt == 0);
				i2cbus->aborted_mt = t;
				i2c_set_irq_pending(i2cbus);
				success = true;
			}
		}
	}
	portENABLE_INTERRUPTS();
	return success;
}

hal_i2c_smbus_handle_t hal_i2c_open_smbus_host(int bus_instance, hal_i2c_smbus_host_params_t *params) {
	SYS_ASSERT(params);
	SYS_ASSERT((1 <= bus_instance) && (bus_instance <= I2C_INSTANCES_COUNT));
	SYS_ASSERT(params->isrcallbackMessageReceived);
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[bus_instance-1]);
	bool success = false;
	portDISABLE_INTERRUPTS();
	if ((i2cbus->mode == hi2cModeSMBus) && (i2cbus->smbus_host_enabled == false)) {
		i2cbus->smbus_host_enabled = true;
		i2cbus->smbus_host_params = *params;
		i2c_request_change_slave_mode(i2cbus);
		success = true;
	}
	portENABLE_INTERRUPTS();
	if (!success)
		i2cbus = 0;
	return (hal_i2c_smbus_handle_t)i2cbus;
}

void hal_i2c_close_smbus_host(hal_i2c_smbus_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(i2cbus, handle)
	portDISABLE_INTERRUPTS();
	if (i2cbus->smbus_host_enabled == true) {
		i2cbus->smbus_host_enabled = false;
		i2cbus->smbus_host_params.userid = 0;
		i2cbus->smbus_host_params.isrcallbackMessageReceived = 0;
		i2c_request_change_slave_mode(i2cbus);
	}
	portENABLE_INTERRUPTS();
}

void* hal_i2c_get_smbus_userid(hal_i2c_smbus_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(i2cbus, handle)
	return i2cbus->smbus_host_params.userid;
}

static void i2c_push_to_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t) {
	SYS_ASSERT(DLLIST_IS_IN_LIST(hal_i2c_mt_queue, 0, t));
	DLLIST_ADD_TO_LIST_BACK(hal_i2c_mt_queue, &i2cbus->mt_queue, t);
}

