EgorNezox/Lol/system/qm-platform/stm32f2xx/HAL/src/i2c.c
static struct hal_i2c_master_transfer_t* i2c_pop_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus) {
	struct hal_i2c_master_transfer_t *next = DLLIST_GET_LIST_FRONT(&i2cbus->mt_queue);
	if (next)
		i2c_remove_from_master_transfer_queue(i2cbus, next);
	return next;
}

static bool i2c_master_transfer_queue_is_empty(struct s_i2cbus_pcb *i2cbus) {
	return DLLIST_IS_LIST_EMPTY(&i2cbus->mt_queue);
}

static void i2c_remove_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t) {
	SYS_ASSERT(DLLIST_IS_IN_LIST(hal_i2c_mt_queue, &i2cbus->mt_queue, t));
	DLLIST_REMOVE_FROM_LIST(hal_i2c_mt_queue, &i2cbus->mt_queue, t);
}

static inline void i2c_set_irq_pending(struct s_i2cbus_pcb *i2cbus) {
	NVIC_SetPendingIRQ(i2cbus->ev_irq_n);
}

static uint32_t i2c_get_slave_mode_ack(struct s_i2cbus_pcb *i2cbus) {
	uint32_t ack_bit = 0;
	if ((i2cbus->mode != hi2cModeOff) && i2cbus->smbus_host_enabled)
		ack_bit = I2C_CR1_ACK;
	return ack_bit;
}

static inline void i2c_request_start_condition(struct s_i2cbus_pcb *i2cbus) {
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RXNE,TXE flags (if set) will hold interrupt pending
	// set START + prevent setting STOP, PEC requests
	i2cbus->i2c->CR1 = (i2cbus->i2c->CR1 & ~(I2C_CR1_STOP | I2C_CR1_PEC)) | I2C_CR1_START;
	i2cbus->state = stateStartingMaster;
}

static inline void i2c_request_stop_condition(struct s_i2cbus_pcb *i2cbus) {
	/* Set STOP + prevent setting START,PEC requests + clear POS,ENPEC bits + change slave mode ack.
	 * It's a safe place to change ACK bit (also used to service "change slave mode" request, see design note in source header).
	 */
	i2cbus->i2c->CR1 = \
			(i2cbus->i2c->CR1 & ~(I2C_CR1_START | I2C_CR1_PEC | I2C_CR1_ACK | I2C_CR1_POS | I2C_CR1_ENPEC))
			| I2C_CR1_STOP
			| i2c_get_slave_mode_ack(i2cbus);
	i2cbus->smbus_host_change_request = false;
}

static void i2c_stop_master_transfer(struct s_i2cbus_pcb *i2cbus) {
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RXNE,TXE flags (if set) will hold interrupt pending
	/* Set STOP,START + prevent setting PEC request + clear POS,ENPEC bits + change slave mode ack.
	 * It's a safe place to change ACK bit (also used to service "change slave mode" request, see design note in source header).
	 * Here software relies on not clearly documented behavior, but tested on hardware (STM32F207IGH6).
	 * In master mode it generates STOP and then START.
	 */
	i2cbus->i2c->CR1 = \
			(i2cbus->i2c->CR1 & ~(I2C_CR1_PEC | I2C_CR1_ACK | I2C_CR1_POS | I2C_CR1_ENPEC))
			| (I2C_CR1_STOP | I2C_CR1_START)
			| i2c_get_slave_mode_ack(i2cbus);
	i2cbus->smbus_host_change_request = false;
	i2cbus->state = stateMasterFinishing;
}

static void i2c_reset_master_mode(struct s_i2cbus_pcb *i2cbus) {
	i2cbus->i2c->CR2 &= ~(I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
	/* Following operations must be executed exactly in specified sequence in order to
	 * avoid resetting/breaking/missing slave communication which may happen after STOP in multi-master bus.
	 */
	(void)i2cbus->i2c->SR1; // dummy read to reset SB(1st)
	i2c_request_stop_condition(i2cbus);
	i2cbus->i2c->DR = 0; // dummy write to reset SB(2nd) and BTF, it's safe to do after entering slave mode, because DR access ignored until ADDR cleared
}

static void i2c_reset_master_mode_to_idle(struct s_i2cbus_pcb *i2cbus) {
	i2c_reset_master_mode(i2cbus);
	i2cbus->state = stateIdle;
	i2c_set_irq_pending(i2cbus);
}

static void i2c_restore_bus_after_error(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint32_t i2c_SR1_stop_flags) {
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITERREN;
	if ((i2c_SR1 & i2c_SR1_stop_flags) != 0) // we should stop transfer ourselves ?..
		i2c_request_stop_condition(i2cbus);
	else  // ... or peripheral already did it ?
		i2cbus->smbus_host_change_request = true; // just to restore slave mode ack (see design notes in source header)
	i2cbus->state = stateIdle;
	i2c_set_irq_pending(i2cbus);
}

static void i2c_abort_master_transfer(struct s_i2cbus_pcb *i2cbus) {
	SYS_ASSERT((i2cbus->active_mt != 0) && (i2cbus->aborted_mt == 0));
	i2cbus->aborted_mt = i2cbus->active_mt;
	/* All states (except starting tx) will handle abort itself in order to prevent racing with possible bus errors. */
	switch (i2cbus->state) {
	case stateMasterTxStarting: {
		/* Already in sync with data boundary (it's safe to stop here). */
		i2c_reset_master_mode_to_idle(i2cbus);
		break;
	}
	case stateMasterRxFirstN2Bytes:
	case stateMasterTxData:
	case stateMasterTxPEC: {
		/* Required to sync BTF. */
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RXNE,TXE flags will hold interrupt pending
		break;
	}
	case stateMasterFinishing: {
		i2cbus->state = stateStartingMaster;
		break;
	}
	default: break;
	}
	i2cbus->active_mt = 0;
	i2c_set_irq_pending(i2cbus);
}

static void i2c_close_active_master_transfer(struct s_i2cbus_pcb *i2cbus, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	struct hal_i2c_master_transfer_t *t = i2cbus->active_mt;
	i2cbus->active_mt = 0;
	t->isrcallbackTransferCompleted(t, i2cbus->active_mt_result, pxHigherPriorityTaskWoken);
}

static bool i2c_process_master_rx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) == 0) // don't handle AF (it cannot occur in master rx states)
		return false;
	i2cbus->i2c->CR2 &= ~(I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
	switch (i2cbus->state) {
	case stateMasterRxSingleByte:
	case stateMasterRxFirstN2Bytes:
	case stateMasterRxLast2Bytes:
		i2c_restore_bus_after_error(i2cbus, i2c_SR1, (I2C_SR1_BERR));
		// dummy read to clear BTF flag and "push" stopping if required (it's safe to do after entering slave mode, because DR access ignored until ADDR cleared)
		(void)i2cbus->i2c->DR;
		break;
	default: SYS_ASSERT(0);
	}
	i2cbus->i2c->SR1 = ~I2C_SR1_BUS_ERROR_FLAGS;
	if (i2cbus->active_mt) {
		i2cbus->active_mt_result = hi2cErrorBus;
		i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
	}
	return true;
}

