EgorNezox/Lol/system/qm-platform/stm32f2xx/HAL/src/i2c.c
static bool i2c_process_master_tx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) == 0)
		return false;
	i2cbus->i2c->CR2 &= ~(I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
	switch (i2cbus->state) {
	case stateMasterTxData:
	case stateMasterTxPEC:
	case stateMasterTxStopping:
		i2c_restore_bus_after_error(i2cbus, i2c_SR1, (I2C_SR1_AF | I2C_SR1_BERR));
		// dummy read to clear BTF flag, it's safe to do after entering slave mode, because DR access ignored until ADDR cleared
		(void)i2cbus->i2c->DR;
		break;
	default: SYS_ASSERT(0);
	}
	i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
	if (i2cbus->active_mt) {
		if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0)
			i2cbus->active_mt_result = hi2cErrorBus;
		else
			i2cbus->active_mt_result = hi2cErrorDataNACK;
		i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
	}
	return true;
}

static void i2c_receive_master_data_byte(struct s_i2cbus_pcb *i2cbus) {
	uint8_t byte = i2cbus->i2c->DR;
	i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, byte);
	i2cbus->active_mt->data[i2cbus->active_mt_pos++] = byte;
}

static void i2c_transmit_master_data_byte(struct s_i2cbus_pcb *i2cbus) {
	uint8_t byte = i2cbus->active_mt->data[i2cbus->active_mt_pos++];
	i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, byte);
	i2cbus->i2c->DR = byte;
}

static void i2c_request_change_slave_mode(struct s_i2cbus_pcb *i2cbus) {
	i2cbus->smbus_host_change_request = true;
	i2c_set_irq_pending(i2cbus);
}

static bool i2c_process_slave_rx_conditions(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1) {
	if ((i2c_SR1 & I2C_SR1_RXNE) == 0) {
		if ((i2c_SR1 & (I2C_SR1_STOPF | I2C_SR1_BUS_ERROR_FLAGS)) != 0) // BERR flag may also mean Repeated START but we don't support it anyway
			i2cbus->state = stateSlaveStopping;
		return false;
	}
	return true;
}

/* Function returns MAXIMUM raw bytes count scheduled for reception from current buffer position, but not actual count.
 * It looks for closest direction change within (pos, pos+2] buffer range (assuming buffer[pos] at rx direction).
 * Function used in master transfer sequences for N>=2 reception (see STM32F2 reference manual).
 */
static int i2c_get_master_max_bytes_to_receive(struct s_i2cbus_pcb *i2cbus) {
	int bytes = i2cbus->active_mt->size - i2cbus->active_mt_pos + i2cbus->active_mt->use_pec;
	int offset = min(2, bytes - 1 - i2cbus->active_mt->use_pec);
	while (offset > 0) {
		if (i2cbus->active_mt->dirs[i2cbus->active_mt_pos + offset] != hi2cDirectionRx)
			bytes = offset;
		offset--;
	}
	return bytes;
}

static inline uint8_t i2c_calc_pec(uint8_t pec, uint8_t data) {
	return i2c_pec_precalc_table[(pec ^ data) & 0xFF];
}

static void i2c_timer_slave_addr_delay_callback(hal_timer_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(i2cbus, hal_timer_get_userid(handle))
	/* It's a part of workaround for hardware bug (see design notes in source header). */
	portDISABLE_INTERRUPTS();
	if ((i2cbus->mode != hi2cModeOff) && (i2cbus->state == stateSlaveAddressed)) {
		i2cbus->state = stateSlaveReadyToTransfer;
		/* Enable back previously disabled interrupt.
		 * Since ADDR flag is set, it should activate interrupt (and further processing) immediately after this section.
		 */
		i2cbus->i2c->CR2 |= I2C_CR2_ITEVTEN;
	}
	portENABLE_INTERRUPTS();
}

static void i2c_irq_handler(struct s_i2cbus_pcb *i2cbus) {
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	if (i2cbus->aborted_mt != 0) {
		struct hal_i2c_master_transfer_t *t = i2cbus->aborted_mt;
		i2cbus->aborted_mt = 0;
		t->isrcallbackTransferCompleted(t, hi2cErrorAborted, &xHigherPriorityTaskWoken);
	}
	if ((i2cbus->i2c->CR1 & I2C_CR1_PE) != 0) {
		/* I2C status registers must be read very carefully in order to:
		 * - prevent loss of pending flags;
		 * - prevent loss of events occurred while irq handler is active.
		 */
		uint16_t i2c_SR1 = i2cbus->i2c->SR1; // such caching allows independent post-processing of already reset flags.
		/* Process unsupported/unexpected interrupt events. */
		if ((i2c_SR1 & (I2C_SR1_ADD10 | I2C_SR1_OVR | I2C_SR1_PECERR | I2C_SR1_TIMEOUT | I2C_SR1_SMBALERT)) != 0) {
			/* Something wrong, because:
			 * - 10-bit addressing not used (not supported);
			 * - clock stretching isn't disabled (NOSTRETCH=0);
			 * - PEC isn't used (PECEN=0) in any transfer;
			 * - timeout error cannot occur in I2C mode (SMBUS=0);
			 * - SMBus alert feature isn't enabled.
			 */
			SYS_ASSERT(0);
			i2cbus->i2c->SR1 = ~(I2C_SR1_ADD10 | I2C_SR1_OVR | I2C_SR1_PECERR | I2C_SR1_TIMEOUT | I2C_SR1_SMBALERT);
		}
		/* Process very specific error conditions before mode handlers. */
		if (((i2cbus->state == stateIdle) || (i2cbus->state == stateStartingMaster) || (i2cbus->state == stateMasterFinishing))
				&& ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) != 0)) { // error detected on idle bus or errors left from previous aborted transfer and/or finishing procedure ?
			/* Just ignore and reset them before we may enter master/slave transaction (current state either hasn't error handling, or state will be changed). */
			i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
		}
		/* Slave and master handlers must be run exactly in specified sequence in order to
		 * prevent stuck with not handled pending flags kept from some communication scenarios.
		 * In other words, we should consider slave events as more prioritized over master events
		 * due to uncontrolled transitions in slave mode communication.
		 */
		i2c_irq_handler_smbus_host(i2cbus, i2c_SR1, &xHigherPriorityTaskWoken);
		i2c_irq_handler_master(i2cbus, i2c_SR1, &xHigherPriorityTaskWoken);
	}
	portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

static void i2c_irq_handler_smbus_host(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	switch (i2cbus->state) {
	case stateIdle:
	case stateStartingMaster:
	case stateMasterFinishing: { // we handle master states here because of possible multi-master races
		if ((i2c_SR1 & I2C_SR1_ADDR) == 0)
			break;
		/* don't check STOPF flag, because we cannot get it here when clock stretching enabled. */
		/* It's not clearly documented, whether we get ADDR requests when ACK is cleared, or don't.
		 * The most unclear thing is about how hardware behaves in possible racing between changing ACK bit and getting address match on bus.
		 * Just in case...
		 */
		if (((i2cbus->i2c->CR1 & I2C_CR1_ACK) == 0) // proper way to determine peripheral state (don't use smbus_host_enabled value)
				|| (i2cbus->mode == hi2cModeOff)) {
			(void)i2cbus->i2c->SR2; // dummy read to clear ADDR flag (properly synchronized with reading SR1 in i2c_irq_handler())
			break;
		}
		/* Since here controller is in transfer state (either supported one - receiving SMBus Host notification, or any transmission) */
		if (i2cbus->state == stateMasterFinishing) {
			/* Looks like bus master was fast enough to inject its transaction within bus free time between a STOP and START (Tbuf).
			 * (It should not happen with correct controllers, but handle it just in case.)
			 * Various checks within other places assume that no master transfer could wait finishing while slave communication in progress,
			 * so we must close it here.
			 */
			SYS_ASSERT(i2cbus->active_mt); // aborted transfers cannot reach this state
			if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0) {
				i2cbus->active_mt_result = hi2cErrorBus;
				/* No need to reset error flags, it's already done in i2c_irq_handler(). */
			}
			i2cbus->state = stateStartingMaster; // because START request should still be pending
			i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
		}
		i2cbus->last_state = i2cbus->state; // after transfer completion we should return exactly(!) to current state
		(void)i2cbus->i2c->DR; // dummy read to clear RxNE flag, it's safe to do here because DR access ignored until ADDR cleared
		/* Instead of immediately starting transfer (by clearing ADDR) we have to implement workaround for hardware bug (see design notes in source header) */
		i2cbus->state = stateSlaveAddressed;
		hal_timer_start(i2cbus->slave_addr_delay_timer, 1, pxHigherPriorityTaskWoken);
		i2cbus->i2c->CR2 |= I2C_CR2_ITERREN;
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITEVTEN; // otherwise ADDR flag will hold interrupt pending
		break;
	}
	case stateSlaveAddressed:
		/* Nothing to do here. Waiting when slave_addr_delay_timer expires to proceed with following state.
		 * It's a part of workaround for hardware bug (see design notes in source header).
		 * Also don't handle BERR, ARLO, AF errors since they cannot occur in this state.
		 */
		break;
	case stateSlaveReadyToTransfer: {
		/* don't handle BERR, ARLO, AF errors since they cannot occur in this state */
		uint32_t i2c_SR2 = i2cbus->i2c->SR2; // also clears ADDR flag (properly synchronized with reading SR1 in i2c_irq_handler())
		i2cbus->smbushost_transfer_ready = false;
		if ((i2c_SR2 & I2C_SR2_TRA) == 0) {
			SYS_ASSERT((((i2cbus->i2c->OAR1 & I2C_OAR1_ADD1_7) >> POSITION_VAL(I2C_OAR1_ADD1_7)) == I2C_SMBUS_HOST_ADDRESS)
					&& ((i2cbus->i2c->OAR1 & I2C_OAR1_ADDMODE) == 0)
					&& ((i2c_SR2 & (I2C_SR2_DUALF | I2C_SR2_SMBHOST | I2C_SR2_SMBDEFAULT | I2C_SR2_GENCALL)) == 0));
			i2cbus->state = stateSlaveRxSMBusHostAddress;
		} else {
			/* We don't support slave transmitter mode, but it's not possible to abort it. */
			i2cbus->state = stateSlaveTx;
		}
		i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
		break;
	}
	case stateSlaveTx: {
		/* We don't support slave transmitter mode, so we just feeding master until it stops transfer (or error occurs) */
		if ((i2c_SR1 & (I2C_SR1_STOPF | I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) != 0) { // BERR flag may also mean Repeated START, but we don't support it anyway
			/* don't clear flags, leave them for proper processing in stopping state */
			i2cbus->state = stateSlaveStopping;
		} else if ((i2c_SR1 & I2C_SR1_TXE) != 0) {
			i2cbus->i2c->DR = 0xFF; // also clears TXE, BTF flags
		}
		break;
	}
	case stateSlaveRxSMBusHostAddress: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_address = i2cbus->i2c->DR & 0xFF;
		i2cbus->state = stateSlaveRxSMBusHostDataLow;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through
	}
	/* no break */
	case stateSlaveRxSMBusHostDataLow: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_status = i2cbus->i2c->DR & 0xFF;
		i2cbus->state = stateSlaveRxSMBusHostDataHigh;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through
	}
	/* no break */
	case stateSlaveRxSMBusHostDataHigh: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_status |= (i2cbus->i2c->DR << 8) & 0xFF00;
		i2cbus->smbushost_transfer_ready = true;
		i2cbus->state = stateSlaveStopping;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through
	}
	/* no break */
	case stateSlaveStopping: {
		if ((i2c_SR1 & I2C_SR1_RXNE) != 0) { // extra(unexpected) bytes received ?
			i2cbus->smbushost_transfer_ready = false; // invalidate transfer (if any)
			(void)i2cbus->i2c->DR; // dummy read to continue transfer and reset BTF
		}
		if ((i2c_SR1 & (I2C_SR1_STOPF | I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) == 0)
			break;
		/* Dummy write to complete clearing STOPF (synchronized with reading SR1 in i2c_irq_handler() and previous state).
		 * It's safe to write to CR1 in this state:
		 * - if START bit still holds pending request, then it means, that new slave transfer pending and setting it again should not repeat it;
		 * - STOP bit cannot be set in this state (neither by us, neither by hardware, and at least we already in sync with error conditions);
		 * - PEC isn't used nowhere anyway.
		 */
		if ((i2c_SR1 & I2C_SR1_STOPF) != 0)
			i2cbus->i2c->CR1 = (volatile uint32_t)i2cbus->i2c->CR1;
		/* It's ok to check and clear errors even if we are in master mode now (it may happen if START request was pending)
		 * Errors are guaranteed to relate to finished slave transfer, because they cannot occur after START generated only.
		 */
		if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0) {
			i2cbus->smbushost_transfer_ready = false; // invalidate transfer on any error
			i2cbus->i2c->SR1 = ~I2C_SR1_BUS_ERROR_FLAGS;
		}
		if ((i2c_SR1 & I2C_SR1_AF) != 0) // it's not error actually (flag is being left after transmission finished)
			i2cbus->i2c->SR1 = ~I2C_SR1_AF;
		i2cbus->i2c->CR2 &= ~(I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
		i2cbus->state = i2cbus->last_state; // restore source state
		if (i2cbus->smbus_host_enabled && i2cbus->smbushost_transfer_ready)
			i2cbus->smbus_host_params.isrcallbackMessageReceived((hal_i2c_smbus_handle_t)i2cbus, i2cbus->smbushost_address, i2cbus->smbushost_status, pxHigherPriorityTaskWoken);
		break;
	}
	default:
		break;
	}
}

