EgorNezox/Lol/system/qm-platform/stm32f2xx/HAL/src/i2c.c
static void i2c_irq_handler_master(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	switch (i2cbus->state) {
	case stateMasterFinishing: { // must be placed before stateIdle and fall-through to it for post-processing
		SYS_ASSERT(i2cbus->active_mt); // aborted transfers cannot reach this state
		if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0) {
			i2cbus->active_mt_result = hi2cErrorBus; // because we cannot determine whether last byte transferred correctly or not (see design notes in source header)
			/* No need to reset error flags, it's already done in i2c_irq_handler(). */
		}
		if ((i2c_SR1 & I2C_SR1_SB) == 0)
			break; // just wait SB flag...
		i2c_reset_master_mode(i2cbus);
		i2cbus->state = stateIdle;
		i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through
	}
	/* no break */
	case stateIdle: { // this state is universal entry for processing pending (queued) master transfers (either start next one or drop all of them) and other requests
		if ((i2c_SR1 & I2C_SR1_SB) != 0) // yes, everything may happen with this shitty I2C peripheral ! (see design notes in source header)
			i2c_reset_master_mode(i2cbus);
		if (i2cbus->mode == hi2cModeOff) {
			/* Disable interrupts, flush all pending master transfers as aborted (one per interrupt invocation) and quit. */
			i2cbus->i2c->CR2 &= ~(I2C_CR2_ITEVTEN | I2C_CR2_ITERREN); // otherwise possible requests may hold interrupt pending
			struct hal_i2c_master_transfer_t *next_mt = i2c_pop_from_master_transfer_queue(i2cbus);
			if (next_mt) {
				next_mt->isrcallbackTransferCompleted(next_mt, hi2cErrorAborted, pxHigherPriorityTaskWoken);
				i2c_set_irq_pending(i2cbus); // schedule removing next transfer
				break;
			}
			break;
		}
		/* Since here we start servicing pending master-mode requests */
		if (!(!i2c_master_transfer_queue_is_empty(i2cbus) || i2cbus->smbus_host_change_request))
			break;
		i2c_request_start_condition(i2cbus);
		break;
	}
	case stateStartingMaster: { // this state also used for Repeated START, enabling/disabling smbus host and aborting
		/* don't handle BERR, AF, ARLO because they either cannot occur in this state, or already handled in i2c_irq_handler() earlier */
		if ((i2c_SR1 & I2C_SR1_SB) == 0)
			break;
		if (i2cbus->mode == hi2cModeOff) { // it's possible when pending transfer requested master mode and user immediately switched off bus
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		if (i2cbus->active_mt == 0) { // no master transfer in progress ?
			i2cbus->active_mt = i2c_pop_from_master_transfer_queue(i2cbus); // try(!) to fetch next master transfer
			if (i2cbus->active_mt == 0) {
				i2c_reset_master_mode_to_idle(i2cbus);
				break;
			}
			i2cbus->active_mt_result = hi2cSuccess; // optimistic initialization (any error will overwrite it)
			i2cbus->active_mt_pos = 0;
			i2cbus->active_mt_pec = 0;
		}
		uint8_t address = (i2cbus->active_mt->device.address << 1); // transmitter mode selected
		// for zero-size transfer it's important to set transmitter mode
		if ((i2cbus->active_mt->size > 0)
				&& (i2cbus->active_mt_pos < i2cbus->active_mt->size)
				&& (i2cbus->active_mt->dirs[i2cbus->active_mt_pos] == hi2cDirectionRx))
			address |= 0x01; // selects receiver mode
		/* ACK,POS bits must be cleared before addressing starts:
		 * - it's default value used in following master transfer states;
		 * - slave mode addressing must be disabled in case of uncontrolled switching to slave mode (due to bus errors).
		 */
		i2cbus->i2c->CR1 &= ~(I2C_CR1_ACK | I2C_CR1_POS | I2C_CR1_ENPEC);
		/* Starting addressing */
		i2cbus->i2c->CR2 |= I2C_CR2_ITERREN;
		i2cbus->i2c->DR = address; // also clears RxNE flag from previous transfer
		i2cbus->state = stateMasterAddressing;
		i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, address);
		break;
	}
	case stateMasterAddressing: {
		if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) != 0) {
			// interface may be in slave mode here, but disabled slave mode addressing allows us to miss possible ADDR request (and no STOPF possible)
			(void)i2cbus->i2c->SR2; // dummy read to clear ADDR flag (properly synchronized with reading SR1 in i2c_irq_handler())
			i2c_restore_bus_after_error(i2cbus, i2c_SR1, (I2C_SR1_AF | I2C_SR1_BERR));
			i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
			if (i2cbus->active_mt != 0) {
				if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0)
					i2cbus->active_mt_result = hi2cErrorBus;
				else
					i2cbus->active_mt_result = hi2cErrorAddressNACK;
				i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
			}
			break;
		}
		if ((i2c_SR1 & I2C_SR1_ADDR) == 0)
			break;
		if (!((i2cbus->active_mt != 0) && (i2cbus->active_mt->size > 0))) { // zero-sized or aborted transfer ?
			/* Dummy read to clear ADDR flag (properly synchronized with reading SR1 in i2c_irq_handler()).
			 * For zero-size transfer case: transmitter mode ensures no transfer will be started.
			 * Interface may be in slave mode here, but disabled slave mode addressing allows us to miss possible ADDR request (and no STOPF possible).
			 */
			(void)i2cbus->i2c->SR2;
			if (i2cbus->active_mt != 0) {
				i2c_stop_master_transfer(i2cbus);
			} else {
				i2c_reset_master_mode_to_idle(i2cbus);
			}
			break;
		}
		/* Since here we start transfer of data bytes */
		int max_bytes_to_receive = 0; // not used in transmitter mode
		/* Receiver mode: ACK,POS bits must be set (as required) before ADDR cleared */
		if (i2cbus->active_mt->dirs[i2cbus->active_mt_pos] == hi2cDirectionRx) {
			max_bytes_to_receive = i2c_get_master_max_bytes_to_receive(i2cbus);
			if (max_bytes_to_receive > 2)
				i2cbus->i2c->CR1 |= I2C_CR1_ACK;
			if (max_bytes_to_receive == 2)
				i2cbus->i2c->CR1 |= I2C_CR1_POS;
		}
		// dummy read to clear ADDR flag (properly synchronized with reading SR1 in i2c_irq_handler())
		(void)i2cbus->i2c->SR2; // also it starts transfer in receiver mode !
		if (i2cbus->active_mt->dirs[i2cbus->active_mt_pos] == hi2cDirectionRx) {
			/* Receiver mode */
			switch (max_bytes_to_receive) {
			case 1:
				i2cbus->state = stateMasterRxSingleByte;
				i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
				/* don't follow manufacturer recommended sequence to request START/STOP here because it's not safe due to possible ARLO racing */
				break;
			case 2:
				i2cbus->state = stateMasterRxLast2Bytes;
				break;
			case 3:
				i2cbus->state = stateMasterRxFirstN2Bytes;
				break;
			default:
				i2cbus->state = stateMasterRxFirstN2Bytes;
				i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
				break;
			}
		} else {
			/* Transmitter mode */
			i2cbus->state = stateMasterTxStarting;
			i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
		}
		break;
	}
	case stateMasterRxSingleByte: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_RXNE) == 0)
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		if ((i2cbus->active_mt_pos + 1) < i2cbus->active_mt->size) { // not last byte in total transfer ?
			i2c_request_start_condition(i2cbus); // Repeated START
		} else { // last byte in transfer ?
			i2c_stop_master_transfer(i2cbus); // STOP
		}
		/* received byte is data byte (single byte transfers cannot contain PEC) */
		i2c_receive_master_data_byte(i2cbus);
		break;
	}
	case stateMasterRxFirstN2Bytes: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			if ((i2c_SR1 & I2C_SR1_BTF) == 0)
				break;
			i2cbus->i2c->CR1 &= ~I2C_CR1_ACK; // sync with BTF (see above) guarantees that we may safely change ACK bit (holding master mode)
			(void)i2cbus->i2c->DR; // dummy read to start receiving next byte with NACK
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		int max_bytes_to_receive = i2c_get_master_max_bytes_to_receive(i2cbus);
		if (max_bytes_to_receive > 3) {
			if ((i2c_SR1 & I2C_SR1_RXNE) == 0)
				break;
			if (max_bytes_to_receive == 4) // next byte, we will wait for, is N-2 ?
				i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RxNE flag will hold interrupt pending
		} else {
			if ((i2c_SR1 & I2C_SR1_BTF) == 0)
				break;
			i2cbus->i2c->CR1 &= ~I2C_CR1_ACK; // must be disabled before N-2 byte read
		}
		/* received byte is data byte (first N-2 bytes cannot contain PEC) */
		i2c_receive_master_data_byte(i2cbus);
		if (max_bytes_to_receive > 3) // actually means ">2" if we account just received byte
			break;
		i2cbus->state = stateMasterRxLast2Bytes;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through
	}
	/* no break */
	case stateMasterRxLast2Bytes: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_BTF) == 0)
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			i2c_reset_master_mode_to_idle(i2cbus); // also should clear BTF flag
			break;
		}
		if ((i2cbus->active_mt_pos + 2) < i2cbus->active_mt->size) { // not last bytes in total transfer ?
			i2c_request_start_condition(i2cbus); // Repeated START
		} else { // last bytes in total transfer ?
			i2c_stop_master_transfer(i2cbus); // STOP
		}
		for (int i = 0; i < 2; i++) {
			if (!((i == 1) && i2cbus->active_mt->use_pec)) {
				i2c_receive_master_data_byte(i2cbus);
			} else {
				uint8_t pec = i2cbus->i2c->DR;
				if (pec != i2cbus->active_mt_pec)
					i2cbus->active_mt_result = hi2cErrorPEC;
			}
		}
		break;
	}
	case stateMasterTxStarting: { // this extra-state required for special case of aborting
		i2cbus->state = stateMasterTxData;
	}
	/* no break */
	case stateMasterTxData: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			if ((i2c_SR1 & I2C_SR1_BTF) == 0)
				break;
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		if ((i2c_SR1 & I2C_SR1_TXE) == 0)
			break;
		i2c_transmit_master_data_byte(i2cbus);
		if (i2cbus->active_mt_pos < i2cbus->active_mt->size) {
			// transfer direction changed ?
			if (i2cbus->active_mt->dirs[i2cbus->active_mt_pos] != hi2cDirectionTx)
				i2c_request_start_condition(i2cbus); // Repeated START
		} else {
			if (!i2cbus->active_mt->use_pec) {
				i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise TXE flag will hold interrupt pending
				i2cbus->state = stateMasterTxStopping;
			} else {
				i2cbus->state = stateMasterTxPEC;
			}
		}
		break;
	}
	case stateMasterTxPEC: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			if ((i2c_SR1 & I2C_SR1_BTF) == 0)
				break;
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		if ((i2c_SR1 & I2C_SR1_TXE) == 0)
			break;
		i2cbus->i2c->DR = i2cbus->active_mt_pec;
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise TXE flag will hold interrupt pending
		i2cbus->state = stateMasterTxStopping;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through
	}
	/* no break */
	case stateMasterTxStopping: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_BTF) == 0)
			break;
		if (i2cbus->active_mt == 0) { // aborted transfer ?
			i2c_reset_master_mode_to_idle(i2cbus);
			break;
		}
		i2c_stop_master_transfer(i2cbus);
		/* Dummy read to clear BTF flag (it's safe to do after entering slave mode, because DR access ignored until ADDR cleared).
		 * We do it explicitly because we don't want to leave interrupt pending until STOP condition finally generates.
		 */
		(void)i2cbus->i2c->DR;
		break;
	}
	default:
		break;
	}
}

void I2C1_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[0]);
}
void I2C2_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[1]);
}
void I2C3_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[2]);
}
void I2C1_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[0]);
}
void I2C2_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[1]);
}
void I2C3_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[2]);
}
